app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', 'ed4f29798f328a07ab72a709e270f29baaf2d24a', '2011-02-09 11:12:17', 'a2a16369b98c6af8f8fa706e2e3d5c2319bd1359', NULL, '2011-02-09 11:12:17', NULL, 'gautam', 'g@r.com')

  def social_account_add
    user = User.find(params[:user_id])
    self.current_user = User.authenticate( user.login, params[:user][:password].strip )

    if logged_in?
      social_account = SocialAccount.new
      usocial_account = SocialAccount.new
      social_account.user = current_user
      social_account.provider = session[:gigya_user_info][:loginProvider]
      social_account.uid  = session[:gigya_user_info][:UID]
      social_account.save!
---
SELECT * FROM "users" WHERE ("users"."id" = 5)
INSERT INTO "social_accounts" ("created_at", "updated_at", "uid", "user_id", "provider") VALUES('2011-02-16 14:57:28', '2011-02-16 14:57:28', '_gid_q5jcWua3PAR6MaBvVHu+5A==', 5, 'twitter')

  def social_account_linking
    @user = User.find_by_id(params[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = '5') LIMIT 1

  def social_register
    cookies.delete :auth_token

    # If a user with this email already exists, try to link accounts
    user = User.find_by_email(params[:user][:email])
    if user
      return redirect_to social_account_linking_url(user.id)
    end

    @user = get_gigya_user_info
    @user.login = params[:user][:login]
    @user.email = params[:user][:email]
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    @user.save!
    social_account = SocialAccount.new
    social_account.user = @user
    social_account.provider = session[:gigya_user_info][:loginProvider]
    social_account.uid  = session[:gigya_user_info][:UID]
    social_account.save!
---
SELECT "users".id FROM "users" WHERE ("users"."email" = 'gatuam@take1.com') LIMIT 1
INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', '9ea38338948e1a2d816cd38720ad899619c29882', '2011-02-16 13:12:55', '9a1545a4cd7579640b9f3c286b6e288089c8e398', NULL, '2011-02-16 13:12:55', NULL, 'gautam123', 'gautamrege@gmail.com')
INSERT INTO "social_accounts" ("created_at", "updated_at", "uid", "user_id", "provider") VALUES('2011-02-16 13:18:50', '2011-02-16 13:18:50', '_gid_0JRk3dCYmwSlLMTkotGx0g==', 3, 'facebook')